In [ ]:
salary project:

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv ('https://raw.githubusercontent.com/dsrscientist/dataset3/main/Salaries.csv')

In [3]:
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary
0        Prof          B             19           18  Male  139750
1        Prof          B             20           16  Male  173200
2    AsstProf          B              4            3  Male   79750
3        Prof          B             45           39  Male  115000
4        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [5]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      Prof          B             19           18  Male  139750
1      Prof          B             20           16  Male  173200
2  AsstProf          B              4            3  Male   79750
3      Prof          B             45           39  Male  115000
4      Prof          B             40           41  Male  141500

In [6]:
df.tail()

         rank discipline  yrs.since.phd  yrs.service   sex  salary
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

In [7]:
df.sample()

          rank discipline  yrs.since.phd  yrs.service     sex  salary
316  AssocProf          B             12            9  Female   71065

In [8]:
# index at axis = 1
type(df.columns)

pandas.core.indexes.base.Index

In [9]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')

In [10]:
df.sample(3)

     rank discipline  yrs.since.phd  yrs.service   sex  salary
305  Prof          A             33           31  Male  111350
264  Prof          A             37           35  Male   99000
385  Prof          A             15            9  Male  114330

In [11]:
df.shape

(397, 6)

In [13]:
df.isnull().sum().sum()

0

In [14]:
df.isnull()

      rank  discipline  yrs.since.phd  yrs.service    sex  salary
0    False       False          False        False  False   False
1    False       False          False        False  False   False
2    False       False          False        False  False   False
3    False       False          False        False  False   False
4    False       False          False        False  False   False
..     ...         ...            ...          ...    ...     ...
392  False       False          False        False  False   False
393  False       False          False        False  False   False
394  False       False          False        False  False   False
395  False       False          False        False  False   False
396  False       False          False        False  False   False

[397 rows x 6 columns]

In [15]:
False == 0

True

In [16]:
True == 1

True

In [17]:
df.isnull().sum()

rank             0
discipline       0
yrs.since.phd    0
yrs.service      0
sex              0
salary           0
dtype: int64

In [18]:
df.isnull().sum().sum()

0

In [1]:
import seaborn as sns

In [4]:
sns.scatterplot(x="Rank",y="Salary",data=df)

NameError: name 'df' is not defined

In [5]:
sns.scatterplot(x="Discipline",y="Salary",data=df)

NameError: name 'df' is not defined

In [6]:
sns.scatterplot(x="yrs.since.phd",y="Salary",data=df)

NameError: name 'df' is not defined

In [7]:
df.corr()

NameError: name 'df' is not defined

In [8]:
import matplotlib.pyplot as plt
#size of convas
plt.figure(figsize=(15,7))
sns.headmap(df.corr(),annot=True,linewidth=0.5,linecolor="break",fmt='2f')

AttributeError: module 'seaborn' has no attribute 'headmap'